
let text = request.params.text;
if(!text) text = 'البري الآسيوي يصل للحدود الغربية لألمانيا الحاليّة، أما اليوم فقد تقلّص موطن الأخدر بشكل كبير جدا عمّا كان عليه في السابق، بحيث تعتبر الجمهرة في جنوبي منغوليا أكبر الجمهرات عددا حيث تمثّل نسبة 80% من جميع الحيوانات الباقية على قيد الحياة من هذا النوع، أما باقي الجمهرات فيبلغ عدد أفرادها جميعا أقل من مئة. وقد تمّ مؤخرا إعادة إدخال الأخدر إلى بعض المناطق التي إنتشر فيها سابقا في منغوليا وإيران وإسرائيل والسعودية. تعتبر الحمر الأخدريّة أكبر قدا بقليل من الحمر المستأنسة حيث يبلغ وزنها حوالي 290 كيلوغراما وطول رأسها وجسمها معا 2.1 متر، كما وأنها أشبه بالحصان منها، وللأخدر قوائم قصيرة نسبيا مقارنة بالأحصنة ولونها يختلف بحسب تغيّر الفصول فهي عادة خمريّة اللون في الصيف ومن ثم تتغير إلى بنيّة مصفرّة في الفصول الماطرة، وتمتلك هذه الحمر خطا أسود يحده لون أبيض من الجهتين على طول';

let t = new Icu.Transliterator('Any-Latin; any-NFD; Any-Publishing; [:^ascii:]Any-Remove');
text = t.transliterate(text);


let res = <><form>
	<textarea name='text' rows='20' cols='80'>{esc.xml(text)}</textarea>
	<input type='submit'/>
</form>
</>;
return res;
